InformationRegisters/ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалогаДобавленныеВРеализацию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_Реализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Реализация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РеализованныеОбъектыЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_НачислениеПроцентовДетально</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ПрибылиИУбыткиОтРеализации</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиБУ</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРеализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеСкидки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяЦена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Comment>Сумма оценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/ЛБ_ОчисткаОбъектовЗалогаДобавленныхВРеализацию/Ext/Form/Module.bsl
&НаСервере
Процедура ОчиститьНасервере() 
	УдСтроки = новый СписокЗначений;
	Для каждого Стр Из ТаблицаЗалогов Цикл 
		Если Стр.Очистить тогда
			НаборЗаписей = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьНаборЗаписей();
		    НаборЗаписей.Отбор.ЗалоговыйБилет.Установить(Стр.ЗалоговыйБилет); 
			НаборЗаписей.Отбор.ОбъектЗалога.Установить(Стр.ОбъектЗалога);
		    НаборЗаписей.Записать();  
			УдСтроки.Добавить(Стр); 
		КонецЕсли;	
	КонецЦикла;              
	Для каждого Эл Из УдСтроки Цикл 
		ТаблицаЗалогов.Удалить(Эл.Значение);
	Конеццикла;	
КонецПроцедуры	
		
&НаКлиенте
Процедура ОчиститьВыбранные(Команда)  
	ЕстьОтмеченные = Ложь;
	Для каждого Стр Из ТаблицаЗалогов Цикл
		Если Стр.Очистить Тогда 
			ЕстьОтмеченные = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	     
	
	Если НЕ ЕстьОтмеченные Тогда
		Предупреждение("Не выбран ни один объект залога!", 60);
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНетОтмена;
    Ответ = Вопрос("Вы уверены, что хотите очистить выбранные залоги?", Режим, 0);
    Если Ответ = КодВозвратаДиалога.Да Тогда
        ОчиститьНасервере();
    КонецЕсли; 	
КонецПроцедуры  

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации КАК Реализация,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный КАК Ответственный,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗалоговыйБилет,
	               |	Артикул";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	ТаблицаЗалогов.Загрузить(ТаблицаЗапроса);
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьВсе(Команда)
	ЗаполнитьВсеНаСервере();
КонецПроцедуры

&НаСервере
Функция ДобавитьПоНомеруЗБ(НомерЗБ)
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации КАК Реализация,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный КАК Ответственный,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	               |			И (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет.НомерЗалоговогоБилета = &НомерЗБ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗалоговыйБилет,
	               |	Артикул";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	Если  ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат "Изделия по номеру ЗБ " + сокрЛП(НомерЗБ) + " не найдены.";  
	Иначе 
		Для каждого Стр из ТаблицаЗапроса цикл  
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
			Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
			Строки = ТаблицаЗалогов.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				НоваяСтр  = ТаблицаЗалогов.Добавить();
				НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;  
				НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
				НоваяСтр.Артикул = Стр.Артикул;
				НоваяСтр.Реализация = Стр.Реализация; 
				НоваяСтр.Ответственный = Стр.Ответственный; 
				НоваяСтр.Очистить = Истина; 
			КонецЕсли;	
		Конеццикла;	
		Возврат "";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоНомеруЗБ(Команда)
	НомерЗБ = "";
	Если ВвестиЗначение(НомерЗБ, "Введите номер ЗБ") Тогда
	    СтрокаСообщение = ДобавитьПоНомеруЗБ(НомерЗБ);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	Для каждого Стр Из ТаблицаЗалогов Цикл
		Стр.Очистить = Истина;
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПометку(Команда)
	Для каждого Стр Из ТаблицаЗалогов Цикл
		Стр.Очистить = Ложь;
	Конеццикла;	
КонецПроцедуры 

&НаСервере
Функция ДобавитьПоАртикулу(Артикул)
	Запрос = Новый Запрос;    
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ДокументРеализации КАК Реализация,
	               |	ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.Ответственный КАК Ответственный,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(, Артикул = &Артикул) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию КАК ЛБ_ОбъектыЗалогаДобавленныеВРеализацию
	               |		ПО (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	               |			И (ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗалоговыйБилет,
	               |	Артикул";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();   
	Если  ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат "Изделие с артикулом " + сокрЛП(Артикул) + " не найдено.";  
	Иначе 
		Для каждого Стр из ТаблицаЗапроса цикл  
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", стр.ЗалоговыйБилет);
			Отбор.Вставить("ОбъектЗалога", стр.ОбъектЗалога);
			Строки = ТаблицаЗалогов.НайтиСтроки(Отбор);
			Если Строки.Количество() = 0 Тогда
				НоваяСтр  = ТаблицаЗалогов.Добавить();
				НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;  
				НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
				НоваяСтр.Артикул = Стр.Артикул;
				НоваяСтр.Реализация = Стр.Реализация; 
				НоваяСтр.Ответственный = Стр.Ответственный; 
				НоваяСтр.Очистить = Истина; 
			КонецЕсли;	
		Конеццикла;	
		Возврат "";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьПоАртикулу(Команда)
	Артикул = "";
	Если ВвестиЗначение(Артикул, "Введите артикул") Тогда
	    СтрокаСообщение = ДобавитьПоАртикулу(Артикул);
		Если НЕ ПустаяСтрока(СтрокаСообщение) Тогда
			Предупреждение(СтрокаСообщение, 60);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗалоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаЗалогов.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текстрока.Реализация) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Текстрока.Реализация);
        ОткрытьФорму("Документ.ЛБ_Реализация.Форма.ФормаДокумента", ПараметрыФормы,ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры
